---
kind: property
id: P:Autodesk.Revit.DB.Visual.Water.WaterType
source: html/537db636-429d-4132-cede-f8e496fe7bd1.htm
---
# Autodesk.Revit.DB.Visual.Water.WaterType Property

The property labeled "Type" from the "Water" schema.

## Syntax (C#)
```csharp
public static string WaterType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterType".